//
//  serviceInfo.swift
//  ApplePark
//
//  Created by 강승우 on 10/7/24.
//

let serviceInfoText = """
    * 보상 판매 서비스는 Apple의 보상 판매 파트너사를 통해 제공됩니다. 보상 판매 견적액은 예상 금액일 뿐이며, 실제 보상 판매 금액이 예상 금액보다 낮을 수도 있습니다. 보상 판매 금액은 보상 판매 대상이 되는 제품의 상태, 연도, 모델, 그리고 보상 판매 대상이 되는 제품이 최초 판매된 국가/지역에 따라 달라집니다. 일부 기기는 보상 판매 대상이 아닙니다. 크레딧 또는 Apple Store Gift Card로 보상 판매를 받으려면 성인 연령 이상이어야 합니다. 새 Apple 기기 구매 시, 현재 소유한 기기의 가치만큼 할인을 받을 수도 있습니다. 최종 확정 금액은 보상 판매 대상 기기를 수령한 후, 예상 금액 산정 시 제시한 기기의 설명과 일치하는지 비교 검수 후 정해집니다. 매장에서 보상 판매를 받으려면 사진이 부착된 정부 발행의 유효한 신분증이 필요합니다. 일부 매장에서는 본 프로그램을 이용할 수 없습니다. 온라인과 오프라인 매장의 보상 판매 금액은 차이가 있을 수 있습니다. 일부 매장에서는 추가 요구 사항이 있을 수 있습니다. Apple의 보상 판매 파트너사는 어떤 보상 판매도 거래를 거부하거나, 취소하거나 보상 판매 기기 및 그 수량을 제한할 권리를 보유합니다. 더 자세한 내용은 적용 대상 기기에 대한 보상 판매 및 재활용 서비스를 제공하는 Apple의 보상 판매 파트너사에서 확인할 수 있습니다. Apple 보상 판매 파트너사의 약관이 추가로 적용될 수 있습니다.
    
    ^ Apple Arcade 무료 체험 혜택은 신규 가입자 및 조건에 부합하는 재가입자에게만 적용됩니다. 무료 체험 기간이 끝나면 월 월 6,500원에 이용할 수 있습니다. 본인 또는 가족 구성원이 구입한 기기 수에 상관없이, 무료 체험 혜택은 Apple ID당 한 번 또는 본인이 \'가족 공유\' 그룹의 구성원일 경우 그룹당 한 번만 제공됩니다. 본인 또는 가족 구성원이 이미 Apple Arcade 3개월 무료 체험 혜택을 이용한 경우에는 이 혜택을 이용할 수 없습니다. 무료 체험 혜택은 적용 대상 기기 활성화 이후 3개월 이내에 신청할 수 있습니다. 멤버십은 매월 자동으로 갱신되며, 해지 시 종료됩니다. 제한 사항 및 기타 약관이 적용됩니다.
    
    ^ 신규 가입자 및 조건에 부합하는 재가입자에게만 적용됩니다. 멤버십 요금은 월 6,500원이며, 해지 시 종료됩니다. 무료 체험 혜택은 Apple ID당 한 번 또는 가족 그룹당 한 번만 제공됩니다. 약관이 적용됩니다.
    
    †이전 세대와 비교한 결과입니다.
    
    ** Apple TV+ 이용을 위해서는 구독이 필요합니다.
    
    * 신규 가입자에게만 적용됩니다. 무료 체험 기간이 끝나면 월 월 8,900원에 이용할 수 있습니다. 본 프로모션은 한정된 기간 동안 진행되며, 적용 대상 새 기기를 구입한 Apple Music 신규 구독자에게만 적용됩니다. 적용대상 오디오 기기에 대해 혜택을 이용하려면 iOS 또는 iPadOS 최신 버전을 설치한 Apple 기기와 연결하거나 페어링해야 합니다. Apple Watch에 대해 혜택을 이용하려면 iOS 최신 버전을 설치한 iPhone에 연결하거나 페어링해야 합니다. 무료 체험 혜택은 적용 대상 기기 활성화 이후 3개월 안에 신청할 수 있습니다. 구입한 적용 대상 기기 수에 상관없이, 무료 체험 혜택은 Apple ID당 한 번만 제공됩니다. 멤버십은 매월 자동으로 갱신되며, 해지 시 종료됩니다. 특정 제한 사항 및 기타 약관이 적용됩니다.
    """

var products: [String] = ["iPhone", "AppleWatch", "iPad", "Mac", "AirPods", "AppleTV", "etc"]
var accessories: [String] = ["모든 액세서리"/*, "MagSafe", "Apple Watch 밴드", "홈", "충전", "케이스 & 보호장비", "오디오", "Beats by Dr. Dre"*/]

var newTidings: [String] = ["newTiding1", "newTiding2", "newTiding3", "newTiding4", "newTiding5", "newTiding6", "newTiding7", "newTiding8", "newTiding9",]

var newTidingPhones: [String] = [
    "newTidingPhone1",
    "newTidingPhone2",
]

var appleStores: [String] = [
    "appleStore1",
    "appleStore2",
    "appleStore3",
    "appleStore4",
    "appleStore5",
    "appleStore6",
]
