//
//  ProductDetailInfo.swift
//  ApplePark
//
//  Created by 홍지수 on 10/8/24.
//

import SwiftUI

let categories = ["iPhone", "AppleWatch", "iPad", "Mac", "AirPods", "Apple TV", "etc"]

let titleTextOnes = ["Apple Trade In", "무료 배송"]

let categoryTextOnes = [
    "iPhone 12 이상의 모델을 보상 판매하면 iPhone 16 또는 \niPhone 16 Pro 구입 시 사용할 수 있는 ₩ 200,000-W930,000 상당의 크레딧이.*",
    "주문하신 상품은 계신 곳까지 무료로 배송됩니다. 배송 날짜는 결제 시 확인하세요.\n"
]

let categoryTextTwo = "* 보상 판매 서비스는 Apple의 보상 판매 파트너사를 통해 제공됩니다. 보상 판매 견적액은 예상 금액일 뿐이며, 실제 보상 판매 금액이 예상 금액보다 낮을 수도 있습니다. 보상 판매 금액은 보상 판매 대상이 되는 제품의 상태, 연도, 모델, 그리고 보상 판매 대상이 되는 제품이 최초 판매된 국가/지역에 따라 달라집니다. 일부 기기는 보상 판매 대상이 아닙니다. /n 크레딧 또는 Apple Store Gift Card로 보상 판매를 받으려면 성인 연령 이상이어야 합니다. 새 Apple 기기 구매 시, 현재 소유한 기기의 가치만큼 할인을 받을 수도 있습니다. 최종 확정 금액은 보상 판매 대상 기기를 수령한 후, 예상 금액 산정 시 제시한 기기의 명과 일치하는지 비교 검수 후 정해집니다. 매장에서 보상 판매를 받으려면 사진이 부착된 정부 발행의 유효한 신분증이 필요합니다. 일부 매장에서는 본 프로그램을 이용할 수 없습니다. 온라인과 오프라인 매장의 보상 판매 금액은 차이가 있을 수 있습니다. \n 일부 매장에서는 추가 요구 사항이 있을 수 있습니다. Apple의 보상 판매 파트너는 어떤 보상 판매도 거래를 거부하거나, 취소하거나 보상 판매 기기 및 그 수량을 제한할 권리를 보유합니다. 더 자세한 내용은 적용 대상 기기에 대한 보상 판매 및 재활용 서비스를 제공하는 Apple의 보상 판매 파트너사에서 확인할 수 있습니다. Apple 보상 판매 파트너사의 약관이 추가로 적용될 수 있습니다."
